Tekla Open API Reference for Tekla Structures 2025
ProfileItem Properties
The ProfileItem type exposes the following members.
Properties
Name | Description
aProfileItemCrossSections |  Obsolete.
 An array list with the profile item cross-sections.
aProfileItemParameters
 An array list with the profile item parameters.
IsCLBProfile
 Whether the profile is a clb profile.
IsHardcodedProfile
 Whether the profile is a parametric user-defined hard coded profile.
IsMultiCrossSectionUserParametric
 Whether the profile is a parametric user-defined multi cross section profile.
IsSketchedUserParametric
 Whether the profile is a parametric user-defined sketched profile.
NumberOfCrossSections
 The number of cross sections in the profile item.
ParameterString
 The profile item parameter string.
ProfileItemCrossSections
 The list of profile item cross-sections.
ProfileItemSubType
 The profile item subtype.
ProfileItemType
 The profile item type.
Top
See Also
Reference
ProfileItem Class
Tekla.Structures.Catalogs Namespace